"Dashboard" = "Panou";
"New Invoice" = "Factură Nouă";
"Total" = "Total";
"Paid" = "Plătit";
"Pending" = "În așteptare";
"Overdue" = "Întârziat";
"Draft" = "Ciornă";
"No client" = "Fără client";
"No invoices yet" = "Nicio factură încă";
"Create your first invoice to get started" = "Creați prima factură pentru a începe";
"Create Invoice" = "Creare Factură";
"Search invoices..." = "Căutare facturi...";
"Delete Invoice" = "Șterge Factura";
"Are you sure you want to delete this invoice?" = "Sigur doriți să ștergeți această factură?";
"Cancel" = "Anulare";
"Due" = "Scadență";
"invoices" = "facturi";
"Invoices" = "Facturi";
"Estimates" = "Devize";
"Clients" = "Clienți";
"Items" = "Articole";
"Reports" = "Rapoarte";
"Settings" = "Setări";
"Language" = "Limbă";
"App Language" = "Limba aplicației";
"Theme" = "Temă";
"New" = "Nou";
"Save" = "Salvează";
"Preview" = "Previzualizare";
"Preferences" = "Preferințe";
"Delete" = "Șterge";
"Duplicate" = "Duplică";
"Undo" = "Anulează";
"Redo" = "Refă";
"Client" = "Client";
"Details" = "Detalii";
"Number" = "Număr";
"Issue Date" = "Data emiterii";
"Due Date" = "Data scadenței";
"Currency" = "Monedă";
"Status" = "Stare";
"Notes" = "Note";
"Line Items" = "Linii";
"Qty" = "Cant.";
"Unit Price" = "Preț unitar";
"Tax %" = "TVA %";
"Discount %" = "Discount %";
"Subtotal (HT)" = "Subtotal (HT)";
"Tax (TVA)" = "TVA";
"Total (TTC)" = "Total (TTC)";

